---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilderResult.Outcome
source: html/2da60445-35fa-81b1-e3df-e56f0ec408a1.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult.Outcome Property

What kinds of geometrical objects were built.

## Syntax (C#)
```csharp
public TessellatedShapeBuilderOutcome Outcome { get; }
```